# Análise + SQL

Neste mini-projeto utilizarei a linguagem sql para responder algumas perguntas utilizando query sql e um pouco de pandas para manipulação de dados.

Utilizaremos SQL para quatro perguntas:
* Quais são os gêneros musicais presentes no database?
* Quantos são os artistas presentes no DB e quais?
* Quantos são os álbuns?
* Quais os 5 artistas com mais álbuns?

In [1]:
#imports de bibliotecas
import pandas as pd
import sqlite3

In [2]:
# Atribuindo uma variável com o nome do database
db= 'chinook.db'

In [3]:
# Criando consulta Para retornar os gêneros do database:
conn = sqlite3.connect(db)

cursor = conn.cursor()

query = '''SELECT name AS Generos FROM genres'''

cursor.execute(query)

generos = pd.read_sql(query, conn)

generos

               Generos
0                 Rock
1                 Jazz
2                Metal
3   Alternative & Punk
4        Rock And Roll
5                Blues
6                Latin
7               Reggae
8                  Pop
9           Soundtrack
10          Bossa Nova
11      Easy Listening
12         Heavy Metal
13            R&B/Soul
14   Electronica/Dance
15               World
16         Hip Hop/Rap
17     Science Fiction
18            TV Shows
19    Sci Fi & Fantasy
20               Drama
21              Comedy
22         Alternative
23           Classical
24               Opera

In [4]:
# Criando consulta para Retornar o nome dos artistas sem duplicatas
conn = sqlite3.connect(db)

cursor = conn.cursor()

query = '''SELECT DISTINCT Name as Artistas FROM artists'''

cursor.execute(query)

artistas = pd.read_sql(query, conn)

artistas

                                              Artistas
0                                                AC/DC
1                                               Accept
2                                            Aerosmith
3                                    Alanis Morissette
4                                      Alice In Chains
..                                                 ...
270   Mela Tenenbaum, Pro Musica Prague & Richard Kapp
271                             Emerson String Quartet
272  C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon...
273                                      Nash Ensemble
274                              Philip Glass Ensemble

[275 rows x 1 columns]

In [5]:
# Criando consulta para retornar a contagem de número de álbuns
conn = sqlite3.connect(db)

cursor = conn.cursor()

query = '''SELECT COUNT(title) AS n_albuns FROM albums'''

cursor.execute(query)

albuns = pd.read_sql(query, conn)

albuns

   n_albuns
0       347

In [6]:
# Criando consulta para retornar o id das 5 bandas com mais álbuns
conn = sqlite3.connect(db)

cursor = conn.cursor()

query = '''SELECT DISTINCT Artistid AS ArtistasID, COUNT(Title) AS albuns FROM albums
            GROUP BY ArtistasID
            ORDER BY albuns DESC
            LIMIT 5'''

cursor.execute(query)

n_musicas = pd.read_sql(query, conn)

n_musicas

   ArtistasID  albuns
0          90      21
1          22      14
2          58      11
3          50      10
4         150      10

In [7]:
# Criando Consulta para retornar os artistas dos id da consulta anterior
conn= sqlite3.connect(db)

cursor = conn.cursor()

query = '''SELECT artistid AS ArtistasID, Name AS artistas FROM artists
           WHERE Artistid  IN (90, 22, 58, 50, 150)'''

cursor.execute(query)

artistas1 = pd.read_sql(query, conn)

artistas1

   ArtistasID      artistas
0          22  Led Zeppelin
1          50     Metallica
2          58   Deep Purple
3          90   Iron Maiden
4         150            U2

In [8]:
# Usando pandas para dar juntar as duas tabelas
albuns_artistas = pd.merge(artistas1, n_musicas, on='ArtistasID' ,how='left')

In [9]:
albuns_artistas

   ArtistasID      artistas  albuns
0          22  Led Zeppelin      14
1          50     Metallica      10
2          58   Deep Purple      11
3          90   Iron Maiden      21
4         150            U2      10

## Resultados:

### Quais são os gêneros músicais presentes na base de dados?

In [10]:
generos

               Generos
0                 Rock
1                 Jazz
2                Metal
3   Alternative & Punk
4        Rock And Roll
5                Blues
6                Latin
7               Reggae
8                  Pop
9           Soundtrack
10          Bossa Nova
11      Easy Listening
12         Heavy Metal
13            R&B/Soul
14   Electronica/Dance
15               World
16         Hip Hop/Rap
17     Science Fiction
18            TV Shows
19    Sci Fi & Fantasy
20               Drama
21              Comedy
22         Alternative
23           Classical
24               Opera

### Quantos são os artistas presentes na plataforma?

R: 275 artistas

In [11]:
artistas

                                              Artistas
0                                                AC/DC
1                                               Accept
2                                            Aerosmith
3                                    Alanis Morissette
4                                      Alice In Chains
..                                                 ...
270   Mela Tenenbaum, Pro Musica Prague & Richard Kapp
271                             Emerson String Quartet
272  C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon...
273                                      Nash Ensemble
274                              Philip Glass Ensemble

[275 rows x 1 columns]

### Quantos são os albuns presentes no DB?

R: 347 albuns

In [12]:
albuns

   n_albuns
0       347

### Quais são os 5 artistas com mais albuns?

In [13]:
albuns_artistas

   ArtistasID      artistas  albuns
0          22  Led Zeppelin      14
1          50     Metallica      10
2          58   Deep Purple      11
3          90   Iron Maiden      21
4         150            U2      10